{

    "backend-title": "Backend",
    "backend-list-1": "PHP",
    "backend-list-2": "Laravel",
    "backend-list-3": "Node",
    "backend-list-4": "MySQL",
    "backend-list-5": "MongoDB",

    "css-title": "CSS",
    "css-list-1": "SASS",
    "css-list-2": "CSS Modules",
    "css-list-3": "PostCSS",
    "css-list-4": "Flexbox",
    "css-list-5": "Grid",
    "css-list-6": "Bootstrap",
    
    "footer-disclaimer": "Aviso +18: Citas de Breaking Bad API. ¡Pulsa en ella para cargar otra!",

    "header-link-linkedin": "LinkedIn",
    "header-link-github": "GitHub",
    "header-link-telephone": "+34 684 07 44 30",
    "header-link-email": "ingeniero92@gmail.com",
    "header-link-download": "Descargar CV",
    "header-login-placeholder": "Introduce Usuario...",
    "header-login": "Conectar",
    "header-logout": "Desconectar",

    "home-title": "Inicio",
    "home-text-1": "Soy una persona amable, trabajadora y entusiasta, que le encanta seguir aprendiendo y enseñando lo que se junto a un equipo, dandolo todo con el propósito de crear código de la máxima calidad posible como he ido aprendiendo tanto en la carrera como posteriormente en el entorno laboral.",
    "home-text-2": "Todo el código de esta web está público para revisar el estilo del código y la metodología, cuyo enlace se puede encontrar en la cabecera de la página. Las tecnologías y paquetes usados para crear esta web son muy variados e incluso complejos y excesivos para la simplicidad de la apariencia de la web, pero sirven de demostración técnica de lo que he trabajado todos estos años.",
    "home-text-3": "Como breve resumen, la página web ha sido creada con React 18, TypeScript y React Router, y la cual se compone de tres elementos clave: Un sistema de usuarios con React Context y Local Storage que simula una autentificación con Token JWT y avatares aleatorios de Pokemon obtenidos con Redux, Custom Hooks y Axios; otra en la que obtenemos citas de una famosa serie (Breaking Bad) desde una API usando Redux, Thunks y Fetch; y finalmente, un sistema de traducción de la página instantáneo que usa Redux y Custom Hooks. Todo ello maquetado con un cóctel de CSS Modules, PostCSS y SCSS con Flexbox.",
    "home-text-4": "También aparte de la programación tengo muchos más hobbies como el pintado de miniaturas, los juegos de mesa o los videojuegos, los cuales me apasionaría diseñar algún día. Pero lo que más, adoro a los gatos. De hecho, hay uno escondido en la web, ¡a ver si lo encuentras!",

    "info-title": "Graduado en Ingeniería del Software, enfocado a Web: React + Redux, JS, CSS, PHP, MySQL, MongoDB...",
    "info-text-1": "La programación es mi pasión y dedicación desde hace muchos años. Lo ha sido desde que desarrollaba páginas webs con cuatro etiquetas HTML después del colegio como afición, luego graduándome en la Universidad Complutense de Madrid como Ingeniero de Software y finalmente, desarrollándome profesionalmente como diseñador de Aplicaciones Web principalmente en el entorno empresarial y también como freelance desde hace más de 5 años.<br/><br> Continuamente aprendiendo, continuamente innovando.",
    "info-text-2": "Esto es una web creada íntegramente por mi como resumen de los conocimientos a nivel de código que aparecen agrupados por tecnologías en la barra de navegación de un poco más abajo. Ya que, además de servir de enlace a mi CV y datos personales, su verdadera finalidad es exponer una demostración de mi trabajo personal en el repositorio de GitHub, realizado con profesionalidad y mucho mimo.",
    "info-text-3": "Estoy disponible en cualquier de los contactos que aparecen en la cabecera. ¡Muchas gracias por la visita!",

    "methodologies-title": "Metodologías",
    "methodologies-list-1": "Software Engineering",
    "methodologies-list-2": "Scrum",
    "methodologies-list-3": "Kanban",
    "methodologies-list-4": "Clean Code",

    "nav-home": "Sobre mi",
    "nav-packages": "React",
    "nav-css": "CSS",
    "nav-backend": "Backend",
    "nav-methodologies": "Metodologías",

    "patterns-title": "Patrones",
    "patterns-list-1": "Compound Component",
    "patterns-list-2": "Extensible Props",
    "patterns-list-3": "Control Props",
    "patterns-list-4": "State Initializer",
    "patterns-list-5": "Function Child",
    
    "personal-title": "Area Personal",
    
    "react-title": "React y paquetes",
    "react-list-1": "TypeScript",
    "react-list-2": "Redux (RTK)",
    "react-list-3": "Context",
    "react-list-4": "MobX",
    "react-list-5": "Custom Hooks",
    "react-list-6": "React Router",
    "react-list-7": "Thunks",
    "react-list-8": "Axios",
    "react-list-9": "Fetch",
    "react-list-10": "Environment Variables",

    "secret-title": "Página Secreta",
    "secret-text": "¡Felicidades! ¡Has encontrado a Nero, el gatito secreto!"

}